src/Enums/ВидыНастроекПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыНастроекПланировщика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СистемнаяУчетнаяЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьDHTMLX</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоРабочегоВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеРабочегоВремени</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыНастроекПланировщика/Ext/ManagerModule.bsl
Функция ПолучитьПризнакНастройкиПоПользователю(НастройкаСсылка)
	МассивНастроек = ПолучитьНастройкиПользователей();
	Возврат (МассивНастроек.Найти(НастройкаСсылка) <> Неопределено);
КонецФункции

Функция ПолучитьДанныеНастройки(НастройкаСсылка) Экспорт
	
	МенеджерОбъекта		= Перечисления.ВидыНастроекПланировщика;
	СтруктураНастройки	= Новый Структура("Подсистема, Настройка, Пользователь, ИмяРесурса, Типы",
		Неопределено, Неопределено, Ложь, "", Неопределено);
	
	ПодсистемаИнтерфейс = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Подсистемы.СтандартныеПодсистемыПТБ.Подсистемы.ПланировщикИнтерфейс);
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемыПТБ.ПланировщикДанные") Тогда
		ПодсистемаДанные = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Подсистемы.СтандартныеПодсистемыПТБ.Подсистемы.ПланировщикДанные);
	Иначе 
		ПодсистемаДанные = Неопределено;
	КонецЕсли;
	
	Типы = Новый Массив;
	
	Если НастройкаСсылка = МенеджерОбъекта.СистемнаяУчетнаяЗапись И ЗначениеЗаполнено(ПодсистемаДанные) Тогда
		Типы.Добавить(Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты"));
		
		СтруктураНастройки.Подсистема	= ПодсистемаДанные;
		СтруктураНастройки.ИмяРесурса	= "ЗначениеСсылка";
		СтруктураНастройки.Типы			= Типы;
	ИначеЕсли НастройкаСсылка = МенеджерОбъекта.ИспользоватьDHTMLX И ЗначениеЗаполнено(ПодсистемаДанные) Тогда
		Типы.Добавить(Тип("Булево"));
		
		СтруктураНастройки.Подсистема	= ПодсистемаДанные;
		СтруктураНастройки.ИмяРесурса	= "ЗначениеБулево";
		СтруктураНастройки.Типы			= Типы;
	ИначеЕсли НастройкаСсылка = МенеджерОбъекта.НачалоРабочегоВремени
		ИЛИ НастройкаСсылка = МенеджерОбъекта.ОкончаниеРабочегоВремени Тогда
		Типы.Добавить(Тип("Число"));
		
		СтруктураНастройки.Подсистема	= ПодсистемаИнтерфейс;
		СтруктураНастройки.ИмяРесурса	= "ЗначениеЧисло";
		СтруктураНастройки.Типы			= Типы;
	КонецЕсли;
	
	СтруктураНастройки.Настройка	= НастройкаСсылка;
	СтруктураНастройки.Пользователь	= ПолучитьПризнакНастройкиПоПользователю(НастройкаСсылка);
	
	Возврат СтруктураНастройки;
	
КонецФункции

Функция ПолучитьНастройкиПользователей() Экспорт
	МассивНастроек	= Новый Массив;
	МассивНастроек.Добавить(Перечисления.ВидыНастроекПланировщика.НачалоРабочегоВремени);
	МассивНастроек.Добавить(Перечисления.ВидыНастроекПланировщика.ОкончаниеРабочегоВремени);
	Возврат МассивНастроек
КонецФункции
